# Series

In [1]:
# pandas is an open source Python library for data analysis. pandas introduces two new data structures to Python - 
# Series and DataFrame, both of which are built on top of NumPy (this means it's fast).

In [2]:
# A Series is a one-dimensional object similar to an array, list, or column in a table. 
# It will assign a labeled index to each item in the Series. 
# By default, each item will receive an index label from 0 to N, where N is the length of the Series minus one.

In [6]:
import pandas as pd
import numpy as np

In [12]:
s1 = pd.Series(['Boston',100,'New York',50,'Houston',500,-19191,[222]])
s1

# Note the default label index assigned

0      Boston
1         100
2    New York
3          50
4     Houston
5         500
6      -19191
7       [222]
dtype: object

In [11]:
s2 = pd.Series([12,3,4,56,88])
s2
# Note the default label index assigned

0    12
1     3
2     4
3    56
4    88
dtype: int64

In [14]:
# Custom index:

s3 = pd.Series(['Boston','New York','Houston'],index =[101,230,456])
s3

101      Boston
230    New York
456     Houston
dtype: object

In [15]:
s4 = pd.Series(['Boston','New York City','Houston'],index =['Mass','New York','Texas'])
s4

Mass               Boston
New York    New York City
Texas             Houston
dtype: object

In [38]:
index_1 = ['Java','Python','C#']
s4_2 = pd.Series(['Spring','Flask','Unknown'],index=index_1)

s4_2

Java       Spring
Python      Flask
C#        Unknown
dtype: object

In [17]:
s4['Mass'] # index is the key of the series. Can be used to get the corresponding value from the series

'Boston'

In [19]:
s3[230]

'New York'

In [21]:
# The Series constructor can convert a dictonary as well, using the keys of the dictionary as its index.

d1 ={'India': 'Delhi','USA':'Washington','Australia':'Canberra'} 
s5 = pd.Series(d1)

s5

Australia      Canberra
India             Delhi
USA          Washington
dtype: object

In [37]:
d2 ={'India': 686,'USA':121,'Australia':394} 
s6 = Series(d2)

s6

Australia    394
India        686
USA          121
dtype: int64

In [23]:
s6[s6>300] # Values in the series > 300

Australia    394
India        686
dtype: int64

In [24]:
s6>300 # boolean 

# Note the difference between this and above

Australia     True
India         True
USA          False
dtype: bool

In [26]:
# Check to see if a key is present in the series:

s6

Australia    394
India        686
USA          121
dtype: int64

In [27]:
'Australia' in s6

True

In [28]:
'Japan' in s6

False

In [29]:
s2

0    12
1     3
2     4
3    56
4    88
dtype: int64

In [31]:
1 in s2

True

In [32]:
12 in s2

False

In [36]:
s5

Australia      Canberra
India             Delhi
USA          Washington
dtype: object

In [35]:
# Convert series to dict:

my_dict = s5.to_dict()
my_dict

{'Australia': 'Canberra', 'India': 'Delhi', 'USA': 'Washington'}

In [43]:
# series can be created from dict and index 

ind_2= ['Nepal','Australia','France','India']
new_series = pd.Series(my_dict,ind_2)

# K-V from my_dict are taken and new K i.e. indexes from ind_2 replace old K  
new_series

Nepal             NaN
Australia    Canberra
France            NaN
India           Delhi
dtype: object

In [44]:
# Check for null

pd.isnull(new_series)

Nepal         True
Australia    False
France        True
India        False
dtype: bool

In [45]:
pd.notnull(new_series)

Nepal        False
Australia     True
France       False
India         True
dtype: bool

In [48]:
new_series+ s5

Australia    CanberraCanberra
France                    NaN
India              DelhiDelhi
Nepal                     NaN
USA                       NaN
dtype: object

In [52]:
s6

Australia    394
India        686
USA          121
dtype: int64

In [51]:
s6+s6

Australia     788
India        1372
USA           242
dtype: int64

In [53]:
# we can name the series

s6.name = "Random numbers for countries"

In [54]:
s6

Australia    394
India        686
USA          121
Name: Random numbers for countries, dtype: int64

In [56]:
# Labelling the indexes of series:

s6.index.name="Country names"

s6

Country names
Australia    394
India        686
USA          121
Name: Random numbers for countries, dtype: int64

# DataFrames

In [72]:
import webbrowser
website ='https://en.wikipedia.org/wiki/NFL_win%E2%80%93loss_records'

webbrowser.open(website)

True

In [58]:
nfl_frame = pd.read_clipboard()

In [59]:
nfl_frame

,Rank,Team,Won,Lost,Tied,Pct.,First,NFL,Season,Total,Games,Division
0,1,Dallas,Cowboys,502,374,6,0.573,1960.000,882,NFC,East,NaN
1,2,Green,Bay,Packers,737,562,37.000,0.565,1921,"1,336",NFC,North
2,3,Chicago,Bears,749,579,42,0.562,1920.000,"1,370",NFC,North,NaN
3,4,Miami,Dolphins,445,351,4,0.559,1966.000,800,AFC,East,NaN
4,5,New,England,Patriots[b],489,386,9.000,0.558,1960,884,AFC,East
5,6,Minnesota,Vikings,470,390,10,0.546,1961.000,870,NFC,North,NaN
6,7,Baltimore,Ravens,190,161,1,0.541,1996.000,352,AFC,North,NaN
7,8,New,York,Giants,687,585,33.000,0.539,1925,"1,305",NFC,East
8,9,Denver,Broncos,470,404,10,0.537,1960.000,884,AFC,West,NaN
9,10,San,Francisco,49ers,528,460,14.000,0.534,1950,"1,002",NFC,Wes

In [60]:
nfl_frame.columns

Index(['Rank', 'Team', 'Won', 'Lost', 'Tied', 'Pct.', 'First', 'NFL', 'Season',
       'Total', 'Games', 'Division'],
      dtype='object')

In [71]:
nfl_frame.iloc[3] # 4th row i.e. 3rd index

Rank               4
Team           Miami
Won         Dolphins
Lost             445
Tied             351
Pct.               4
First          0.559
NFL             1966
Season           800
Total            AFC
Games           East
Division         NaN
Name: 3, dtype: object

In [75]:
nfl_frame['First']

0     0.573
1    37.000
2     0.562
3     0.559
4     9.000
5     0.546
6     0.541
7    33.000
8     0.537
9    14.000
Name: First, dtype: float64

In [79]:
# Create a subset of the dataframe with an additional column called Stadium

DataFrame(nfl_frame, columns=['Team','NFL','Games','Stadium'])

        Team       NFL  Games  Stadium
0     Dallas  1960.000   East      NaN
1      Green     0.565    NFC      NaN
2    Chicago  1920.000  North      NaN
3      Miami  1966.000   East      NaN
4        New     0.558    AFC      NaN
5  Minnesota  1961.000  North      NaN
6  Baltimore  1996.000  North      NaN
7        New     0.539    NFC      NaN
8     Denver  1960.000   West      NaN
9        San     0.534    NFC      NaN

In [83]:
stadiums = pd.Series(['Gillete','Gillete','Levis','Wankhede'],index=[2,3,5,8])

nfl_frame['Staduim'] = stadiums

In [84]:
nfl_frame

,Rank,Team,Won,Lost,Tied,Pct.,First,NFL,Season,Total,Games,Division,Staduim
0,1,Dallas,Cowboys,502,374,6,0.573,1960.000,882,NFC,East,NaN,NaN
1,2,Green,Bay,Packers,737,562,37.000,0.565,1921,"1,336",NFC,North,NaN
2,3,Chicago,Bears,749,579,42,0.562,1920.000,"1,370",NFC,North,NaN,Gillete
3,4,Miami,Dolphins,445,351,4,0.559,1966.000,800,AFC,East,NaN,Gillete
4,5,New,England,Patriots[b],489,386,9.000,0.558,1960,884,AFC,East,NaN
5,6,Minnesota,Vikings,470,390,10,0.546,1961.000,870,NFC,North,NaN,Levis
6,7,Baltimore,Ravens,190,161,1,0.541,1996.000,352,AFC,North,NaN,NaN
7,8,New,York,Giants,687,585,33.000,0.539,1925,"1,305",NFC,East,NaN
8,9,Denver,Broncos,470,404,10,0.537,1960.000,884,AFC,West,NaN,Wankhede
9,10,San,Francisco,49ers,528,460,14.000,0.534,1950,"1,002",NFC,Wes,NaN

In [89]:
# to insert 1 value in an entire col:

nfl_frame['Staduim'] = 'Shashank'
nfl_frame

,Rank,Team,Won,Lost,Tied,Pct.,First,NFL,Season,Total,Games,Division,Staduim
0,1,Dallas,Cowboys,502,374,6,0.573,1960.000,882,NFC,East,NaN,Shashank
1,2,Green,Bay,Packers,737,562,37.000,0.565,1921,"1,336",NFC,North,Shashank
2,3,Chicago,Bears,749,579,42,0.562,1920.000,"1,370",NFC,North,NaN,Shashank
3,4,Miami,Dolphins,445,351,4,0.559,1966.000,800,AFC,East,NaN,Shashank
4,5,New,England,Patriots[b],489,386,9.000,0.558,1960,884,AFC,East,Shashank
5,6,Minnesota,Vikings,470,390,10,0.546,1961.000,870,NFC,North,NaN,Shashank
6,7,Baltimore,Ravens,190,161,1,0.541,1996.000,352,AFC,North,NaN,Shashank
7,8,New,York,Giants,687,585,33.000,0.539,1925,"1,305",NFC,East,Shashank
8,9,Denver,Broncos,470,404,10,0.537,1960.000,884,AFC,West,NaN,Shashank
9,10,San,Francisco,49ers,528,460,14.000,0.534,1950,"1,002",NFC,Wes,Shashank

In [99]:
# input numbers in a column

nfl_frame['Staduim'] = np.arange(1,21,2)
nfl_frame

,Rank,Team,Won,Lost,Tied,Pct.,First,NFL,Season,Total,Games,Division,Staduim
0,1,Dallas,Cowboys,502,374,6,0.573,1960.000,882,NFC,East,NaN,1
1,2,Green,Bay,Packers,737,562,37.000,0.565,1921,"1,336",NFC,North,3
2,3,Chicago,Bears,749,579,42,0.562,1920.000,"1,370",NFC,North,NaN,5
3,4,Miami,Dolphins,445,351,4,0.559,1966.000,800,AFC,East,NaN,7
4,5,New,England,Patriots[b],489,386,9.000,0.558,1960,884,AFC,East,9
5,6,Minnesota,Vikings,470,390,10,0.546,1961.000,870,NFC,North,NaN,11
6,7,Baltimore,Ravens,190,161,1,0.541,1996.000,352,AFC,North,NaN,13
7,8,New,York,Giants,687,585,33.000,0.539,1925,"1,305",NFC,East,15
8,9,Denver,Broncos,470,404,10,0.537,1960.000,884,AFC,West,NaN,17
9,10,San,Francisco,49ers,528,460,14.000,0.534,1950,"1,002",NFC,Wes,19

In [85]:
nfl_frame.head()

,Rank,Team,Won,Lost,Tied,Pct.,First,NFL,Season,Total,Games,Division,Staduim
0,1,Dallas,Cowboys,502,374,6,0.573,1960.000,882,NFC,East,NaN,NaN
1,2,Green,Bay,Packers,737,562,37.000,0.565,1921,"1,336",NFC,North,NaN
2,3,Chicago,Bears,749,579,42,0.562,1920.000,"1,370",NFC,North,NaN,Gillete
3,4,Miami,Dolphins,445,351,4,0.559,1966.000,800,AFC,East,NaN,Gillete
4,5,New,England,Patriots[b],489,386,9.000,0.558,1960,884,AFC,East,NaN

In [86]:
nfl_frame.head(3)

,Rank,Team,Won,Lost,Tied,Pct.,First,NFL,Season,Total,Games,Division,Staduim
0,1,Dallas,Cowboys,502,374,6,0.573,1960.000,882,NFC,East,NaN,NaN
1,2,Green,Bay,Packers,737,562,37.000,0.565,1921,"1,336",NFC,North,NaN
2,3,Chicago,Bears,749,579,42,0.562,1920.000,"1,370",NFC,North,NaN,Gillete

In [87]:
nfl_frame.tail()

,Rank,Team,Won,Lost,Tied,Pct.,First,NFL,Season,Total,Games,Division,Staduim
5,6,Minnesota,Vikings,470,390,10,0.546,1961.000,870,NFC,North,NaN,Levis
6,7,Baltimore,Ravens,190,161,1,0.541,1996.000,352,AFC,North,NaN,NaN
7,8,New,York,Giants,687,585,33.000,0.539,1925,"1,305",NFC,East,NaN
8,9,Denver,Broncos,470,404,10,0.537,1960.000,884,AFC,West,NaN,Wankhede
9,10,San,Francisco,49ers,528,460,14.000,0.534,1950,"1,002",NFC,Wes,NaN

In [88]:
nfl_frame.tail(2)

,Rank,Team,Won,Lost,Tied,Pct.,First,NFL,Season,Total,Games,Division,Staduim
8,9,Denver,Broncos,470,404,10,0.537,1960.000,884,AFC,West,NaN,Wankhede
9,10,San,Francisco,49ers,528,460,14.000,0.534,1950,"1,002",NFC,Wes,NaN

In [103]:
# Creating a dataframe from a dict:

d = {'Country':['India','USA','Canada','Australia'],'Capitals':['Delhi','Washington','Canberra','Ottawa'],
        'Population':[10000,2000,19191,4445]}

new_df = DataFrame(d)

new_df

     Capitals    Country  Population
0       Delhi      India       10000
1  Washington        USA        2000
2    Canberra     Canada       19191
3      Ottawa  Australia        4445

# Index operations

In [105]:
s1 = pd.Series([1,2,3,4],index=['A','B','C','D'])

s1

A    1
B    2
C    3
D    4
dtype: int64

In [107]:
my_index = s1.index # extract indices from s1 to my_index

my_index

Index(['A', 'B', 'C', 'D'], dtype='object')

In [108]:
#Operations can be performed on my_index

my_index[2]

'C'

In [112]:
my_index[:2]

Index(['A', 'B'], dtype='object')

In [111]:
# Indices are immutable:

my_index[0]='Z'

TypeError: Index does not support mutable operations

# Reindexing

In [114]:
import numpy.random

ser1 = pd.Series([10,20,30,40],index=['A','B','C','D'])

ser1

A    10
B    20
C    30
D    40
dtype: int64

In [118]:
ser2 = ser1.reindex(['A','B','ZZZ','D','E','F'])

ser2

A      10.0
B      20.0
ZZZ     NaN
D      40.0
E       NaN
F       NaN
dtype: float64

In [125]:
# New index that is added here, i.e. 'G' will have a value 20

ser2.reindex(['A','B','ZZZ','D','E','F','G'],fill_value =20)

A      10.0
B      20.0
ZZZ     NaN
D      40.0
E       NaN
F       NaN
G      20.0
dtype: float64

In [127]:
# filling empty vals:

ser3 = pd.Series(['USA','India','Canada'],index=[0,5,10])

ser3

0        USA
5      India
10    Canada
dtype: object

In [131]:
ranger = range(15)

ser3.reindex(ranger,method='ffill')

0        USA
1        USA
2        USA
3        USA
4        USA
5      India
6      India
7      India
8      India
9      India
10    Canada
11    Canada
12    Canada
13    Canada
14    Canada
dtype: object

In [136]:
ser4 = pd.Series(['Cat','Dog','Rabbit'],index=[4,9,12])

ser4

4        Cat
9        Dog
12    Rabbit
dtype: object

In [137]:
ranger = range(15)

ser4.reindex(ranger,method='bfill') # backfill

0        Cat
1        Cat
2        Cat
3        Cat
4        Cat
5        Dog
6        Dog
7        Dog
8        Dog
9        Dog
10    Rabbit
11    Rabbit
12    Rabbit
13       NaN
14       NaN
dtype: object

In [140]:
# Reindexing rows and columns in a dataframe

# We create a dataframe:

dframe = DataFrame(np.random.randn(24).reshape(6,4), index =['A','B','D','E','F','G'],columns=['col1','col2','col3','col4'])

dframe

       col1      col2      col3      col4
A -1.490454 -0.242342  1.844233 -1.278484
B -0.009934 -0.457509 -0.111646 -2.109979
D  0.424061 -0.300902  0.496458 -0.884953
E  0.001647 -0.550085 -0.754495 -0.804027
F  0.572087  0.343237 -1.001820  0.222569
G -0.971981 -0.504889 -1.314989 -0.891343

In [143]:
#  we need to insert index 'C' in the row after B

new_cols = ['col1','col2','col3','col4','late_col']
dframe2 = dframe.reindex(['A','B','C','D','E','F','G'], columns=new_cols)

dframe2

       col1      col2      col3      col4  late_col
A -1.490454 -0.242342  1.844233 -1.278484       NaN
B -0.009934 -0.457509 -0.111646 -2.109979       NaN
C       NaN       NaN       NaN       NaN       NaN
D  0.424061 -0.300902  0.496458 -0.884953       NaN
E  0.001647 -0.550085 -0.754495 -0.804027       NaN
F  0.572087  0.343237 -1.001820  0.222569       NaN
G -0.971981 -0.504889 -1.314989 -0.891343       NaN

In [145]:
# Cols can be added separately too

new_cols2 = ['Hi','How','Are','You','Nice','to','Meet','You']

dframe2.reindex(columns=new_cols2)

   Hi  How  Are  You  Nice  to  Meet  You
A NaN  NaN  NaN  NaN   NaN NaN   NaN  NaN
B NaN  NaN  NaN  NaN   NaN NaN   NaN  NaN
C NaN  NaN  NaN  NaN   NaN NaN   NaN  NaN
D NaN  NaN  NaN  NaN   NaN NaN   NaN  NaN
E NaN  NaN  NaN  NaN   NaN NaN   NaN  NaN
F NaN  NaN  NaN  NaN   NaN NaN   NaN  NaN
G NaN  NaN  NaN  NaN   NaN NaN   NaN  NaN

# Drop Entry from Dataframes and Series

In [146]:
s1 = pd.Series([1,2,3,4],index=['Hello','How','are','you'])
s1

Hello    1
How      2
are      3
you      4
dtype: int64

In [147]:
s1.drop('are')

Hello    1
How      2
you      4
dtype: int64

In [149]:
df = DataFrame(np.arange(9).reshape(3,3), index=['LA','SF','NYC'], columns=['col1','col2','col3'])

df

     col1  col2  col3
LA      0     1     2
SF      3     4     5
NYC     6     7     8

In [150]:
# deleting a row:

df.drop('LA')

     col1  col2  col3
SF      3     4     5
NYC     6     7     8

In [151]:
# However thr change is not permanent 

df

     col1  col2  col3
LA      0     1     2
SF      3     4     5
NYC     6     7     8

In [152]:
# To make it permanent, extract it into another dataframe

df2 = df.drop('LA')

In [153]:
df2

     col1  col2  col3
SF      3     4     5
NYC     6     7     8

In [156]:
# Deleting a column:

df.drop('col2',axis=1)

     col1  col3
LA      0     2
SF      3     5
NYC     6     8

# Selecting Entries

In [192]:
s1 = pd.Series(['Hello','How','are','you'],index=[20,30,40,50])

s1

20    Hello
30      How
40      are
50      you
dtype: object

In [159]:
s1[30]

'How'

In [168]:
s1[:2]

20    Hello
30      How
dtype: object

In [164]:
s2= pd.Series([20,40,60],index=['A','B','C'])

s2

A    20
B    40
C    60
dtype: int64

In [166]:
s2[['A','B']]

A    20
B    40
dtype: int64

In [169]:
s2[s2>40]

C    60
dtype: int64

In [172]:
s2[s2>40]=100 # Change all values that satisfy the equation to 100

In [173]:
s2

A     20
B     40
C    100
dtype: int64

In [174]:
df = DataFrame(np.arange(9).reshape(3,3), index=['LA','SF','NYC'], columns=['col1','col2','col3'])

df

     col1  col2  col3
LA      0     1     2
SF      3     4     5
NYC     6     7     8

In [176]:
df['col1']

LA     0
SF     3
NYC    6
Name: col1, dtype: int64

In [177]:
df[['col2','col3']]

     col2  col3
LA      1     2
SF      4     5
NYC     7     8

In [178]:
df

     col1  col2  col3
LA      0     1     2
SF      3     4     5
NYC     6     7     8

In [181]:
df[df['col3']>4]

     col1  col2  col3
SF      3     4     5
NYC     6     7     8

In [182]:
df['col3']>4

LA     False
SF      True
NYC     True
Name: col3, dtype: bool

In [183]:
df >4

      col1   col2   col3
LA   False  False  False
SF   False  False   True
NYC   True   True   True

In [185]:
# selecting by row name

df.ix['LA']

col1    0
col2    1
col3    2
Name: LA, dtype: int64

In [186]:
df.ix['SF']

col1    3
col2    4
col3    5
Name: SF, dtype: int64

In [187]:
df

     col1  col2  col3
LA      0     1     2
SF      3     4     5
NYC     6     7     8

In [190]:
# selecting by row index

df.ix[2]

col1    6
col2    7
col3    8
Name: NYC, dtype: int64

# Data Alignment

In [193]:
s1 = pd.Series([1,2,3,4],index=['A','B','C','D'])

In [194]:
s2 = pd.Series([10,20],index=['A','B'])

In [195]:
s1+s2 # values with same indices are added

A    11.0
B    22.0
C     NaN
D     NaN
dtype: float64

In [196]:
s1.add(s2)

A    11.0
B    22.0
C     NaN
D     NaN
dtype: float64

In [200]:
df1 = DataFrame(np.arange(9).reshape(3,3), index=['LA','SF','NYC'], columns=['col1','col2','col3'])

df1

     col1  col2  col3
LA      0     1     2
SF      3     4     5
NYC     6     7     8

In [201]:
df2 = DataFrame(np.arange(4).reshape(2,2), index=['LA','PA'], columns=['col1','col4'])

df2

    col1  col4
LA     0     1
PA     2     3

In [202]:
df1+df2

# only the elements that are present in both df1 and df2 are summed. Rest are substituted with NaN

     col1  col2  col3  col4
LA    0.0   NaN   NaN   NaN
NYC   NaN   NaN   NaN   NaN
PA    NaN   NaN   NaN   NaN
SF    NaN   NaN   NaN   NaN

In [204]:
df1.add(df2,fill_value=0)

# in this case, the original values of df1 are retained

     col1  col2  col3  col4
LA    0.0   1.0   2.0   1.0
NYC   6.0   7.0   8.0   NaN
PA    2.0   NaN   NaN   3.0
SF    3.0   4.0   5.0   NaN

In [205]:
df1

     col1  col2  col3
LA      0     1     2
SF      3     4     5
NYC     6     7     8

In [206]:
df2

    col1  col4
LA     0     1
PA     2     3

In [208]:
row1 = df1.ix[0]

row1

col1    0
col2    1
col3    2
Name: LA, dtype: int64

In [209]:
row2 = df1.ix[1]

row2

col1    3
col2    4
col3    5
Name: SF, dtype: int64

In [210]:
df1-row1

     col1  col2  col3
LA      0     0     0
SF      3     3     3
NYC     6     6     6

# Rank and Sort

In [213]:
s1 = pd.Series(range(3),index=['B','C','A'])

s1

B    0
C    1
A    2
dtype: int64

In [216]:
s1.sort_index() # sorts index

A    2
B    0
C    1
dtype: int64

In [219]:
s1.sort_values()  #sorts according to values

B    0
C    1
A    2
dtype: int64

In [222]:
s2 = pd.Series(np.random.randn(10))
s2

0    0.508538
1    1.191166
2   -0.291489
3   -0.599519
4   -0.536336
5   -1.661384
6    1.498707
7   -0.855491
8    0.308611
9   -1.149315
dtype: float64

In [224]:
s2.sort_values() # sorts the series according to value form low to high

5   -1.661384
9   -1.149315
7   -0.855491
3   -0.599519
4   -0.536336
2   -0.291489
8    0.308611
0    0.508538
1    1.191166
6    1.498707
dtype: float64

In [228]:
s2

0    0.508538
1    1.191166
2   -0.291489
3   -0.599519
4   -0.536336
5   -1.661384
6    1.498707
7   -0.855491
8    0.308611
9   -1.149315
dtype: float64

In [230]:
s2.rank()

# LHS = index; RHS  = rank of the val

0     8.0
1     9.0
2     6.0
3     4.0
4     5.0
5     1.0
6    10.0
7     3.0
8     7.0
9     2.0
dtype: float64

In [240]:
s3 = pd.Series(np.random.randn(10))
s3

0   -0.288057
1    0.636983
2   -0.169686
3   -1.774849
4    0.755790
5    0.487146
6   -0.751457
7   -1.021159
8   -0.712013
9   -0.277171
dtype: float64

In [245]:
s3.sort_values()
s3.rank()

0     5.0
1     9.0
2     7.0
3     1.0
4    10.0
5     8.0
6     3.0
7     2.0
8     4.0
9     6.0
dtype: float64

# Summary Statistics

In [2]:
import numpy as np
import pandas as pd

arr = np.array([[1,22, np.nan],[np.nan,45,32]])

In [3]:
df = pd.DataFrame(arr, index=['A','B'],columns=['one','two','three'])

In [4]:
df

   one   two  three
A  1.0  22.0    NaN
B  NaN  45.0   32.0

In [5]:
df.sum()

one       1.0
two      67.0
three    32.0
dtype: float64

In [6]:
df.sum(axis=1) # Sum of rows

A    23.0
B    77.0
dtype: float64

In [7]:
df.min() # mins from each column

one       1.0
two      22.0
three    32.0
dtype: float64

In [8]:
df.idxmin()

# shows index for each of the min val

one      A
two      A
three    B
dtype: object

In [9]:
df.max()

one       1.0
two      45.0
three    32.0
dtype: float64

In [10]:
df.cumsum() # Cumulative sum

   one   two  three
A  1.0  22.0    NaN
B  NaN  67.0   32.0

In [11]:
df.describe() # provides summary statistics

       one        two  three
count  1.0   2.000000    1.0
mean   1.0  33.500000   32.0
std    NaN  16.263456    NaN
min    1.0  22.000000   32.0
25%    1.0  27.750000   32.0
50%    1.0  33.500000   32.0
75%    1.0  39.250000   32.0
max    1.0  45.000000   32.0

In [14]:
# check unique vals in a series: 

ser1 = pd.Series(['q','q','c','v','qw','c','o','y','q','p'])
ser1

0     q
1     q
2     c
3     v
4    qw
5     c
6     o
7     y
8     q
9     p
dtype: object

In [15]:
ser1.unique() # shows unique elements

array(['q', 'c', 'v', 'qw', 'o', 'y', 'p'], dtype=object)

In [16]:
ser1.value_counts()

q     3
c     2
o     1
y     1
p     1
qw    1
v     1
dtype: int64

# Missing Data

In [2]:
import numpy as np
import pandas as pd

s1= pd.Series(['one','two',np.nan,'four'])
s1

0     one
1     two
2     NaN
3    four
dtype: object

In [3]:
s1.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
s1.dropna()

0     one
1     two
3    four
dtype: object

In [5]:
s1 # note that the operations are not permanent unless extracted into another series

0     one
1     two
2     NaN
3    four
dtype: object

In [6]:
# Dataframe:

df = pd.DataFrame([[10,20,30],[np.nan,50,40],[60,np.nan,70],[np.nan,np.nan,np.nan]])
df

      0     1     2
0  10.0  20.0  30.0
1   NaN  50.0  40.0
2  60.0   NaN  70.0
3   NaN   NaN   NaN

In [7]:
clean_df = df.dropna() # drops rows where any value was null

clean_df

      0     1     2
0  10.0  20.0  30.0

In [8]:
# to drop a row only when all values are null:

df.dropna(how='all')

      0     1     2
0  10.0  20.0  30.0
1   NaN  50.0  40.0
2  60.0   NaN  70.0

In [9]:
# Drop columns:

df.dropna(axis =1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [12]:
# To get atleast x datapoints from a dataframe: 
n = np.nan
df1 = pd.DataFrame([[1,2,3,4,5,6],[n,3,4,6,n,2],[n,n,3,n,77,22],[n,n,n,n,33,88],[n,n,44,55,n,56]])
df1

     0    1     2     3     4   5
0  1.0  2.0   3.0   4.0   5.0   6
1  NaN  3.0   4.0   6.0   NaN   2
2  NaN  NaN   3.0   NaN  77.0  22
3  NaN  NaN   NaN   NaN  33.0  88
4  NaN  NaN  44.0  55.0   NaN  56

In [15]:
df1.dropna(thresh=3) # show me the dataframe with rows that have at least 3 non null data points

     0    1     2     3     4   5
0  1.0  2.0   3.0   4.0   5.0   6
1  NaN  3.0   4.0   6.0   NaN   2
2  NaN  NaN   3.0   NaN  77.0  22
4  NaN  NaN  44.0  55.0   NaN  56

In [16]:
# Fill null vals:

df1.fillna(333333)

          0         1         2         3         4   5
0       1.0       2.0       3.0       4.0       5.0   6
1  333333.0       3.0       4.0       6.0  333333.0   2
2  333333.0  333333.0       3.0  333333.0      77.0  22
3  333333.0  333333.0  333333.0  333333.0      33.0  88
4  333333.0  333333.0      44.0      55.0  333333.0  56

In [19]:
df1

     0    1     2     3     4   5
0  1.0  2.0   3.0   4.0   5.0   6
1  NaN  3.0   4.0   6.0   NaN   2
2  NaN  NaN   3.0   NaN  77.0  22
3  NaN  NaN   NaN   NaN  33.0  88
4  NaN  NaN  44.0  55.0   NaN  56

In [18]:
# To give different values to null in different columns:

df1.fillna({0:111,1:222,2:333,3:444,4:555,5:666})

       0      1      2      3      4   5
0    1.0    2.0    3.0    4.0    5.0   6
1  111.0    3.0    4.0    6.0  555.0   2
2  111.0  222.0    3.0  444.0   77.0  22
3  111.0  222.0  333.0  444.0   33.0  88
4  111.0  222.0   44.0   55.0  555.0  56

In [20]:
# to make the changes permanent:1. Extract it into another df 2. Use 'inplace'

df

      0     1     2
0  10.0  20.0  30.0
1   NaN  50.0  40.0
2  60.0   NaN  70.0
3   NaN   NaN   NaN

In [21]:
df = df.fillna(99999)

In [22]:
df

         0        1        2
0     10.0     20.0     30.0
1  99999.0     50.0     40.0
2     60.0  99999.0     70.0
3  99999.0  99999.0  99999.0

In [23]:
# Inplace:
df1

     0    1     2     3     4   5
0  1.0  2.0   3.0   4.0   5.0   6
1  NaN  3.0   4.0   6.0   NaN   2
2  NaN  NaN   3.0   NaN  77.0  22
3  NaN  NaN   NaN   NaN  33.0  88
4  NaN  NaN  44.0  55.0   NaN  56

In [24]:
df1.fillna(9999) # fillna doesnt permanently change df1 here

        0       1       2       3       4   5
0     1.0     2.0     3.0     4.0     5.0   6
1  9999.0     3.0     4.0     6.0  9999.0   2
2  9999.0  9999.0     3.0  9999.0    77.0  22
3  9999.0  9999.0  9999.0  9999.0    33.0  88
4  9999.0  9999.0    44.0    55.0  9999.0  56

In [25]:
df1

     0    1     2     3     4   5
0  1.0  2.0   3.0   4.0   5.0   6
1  NaN  3.0   4.0   6.0   NaN   2
2  NaN  NaN   3.0   NaN  77.0  22
3  NaN  NaN   NaN   NaN  33.0  88
4  NaN  NaN  44.0  55.0   NaN  56

In [26]:
df1.fillna(12345,inplace=True) # this changes df1 permanently

In [27]:
df1

         0        1        2        3        4   5
0      1.0      2.0      3.0      4.0      5.0   6
1  12345.0      3.0      4.0      6.0  12345.0   2
2  12345.0  12345.0      3.0  12345.0     77.0  22
3  12345.0  12345.0  12345.0  12345.0     33.0  88
4  12345.0  12345.0     44.0     55.0  12345.0  56

# Index Hierarchy

In [34]:
# i.e. Index of Index

ser = pd.Series(np.random.randn(6),index=[[10,10,10,20,20,20],['a','b','c','a','b','c']])

ser

10  a   -0.080820
    b   -1.184842
    c    1.377157
20  a   -0.424595
    b    1.085462
    c    0.187125
dtype: float64

In [35]:
ser.index

MultiIndex(levels=[[10, 20], ['a', 'b', 'c']],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [37]:
ser[10]

a   -0.080820
b   -1.184842
c    1.377157
dtype: float64

In [38]:
ser[20]

a   -0.424595
b    1.085462
c    0.187125
dtype: float64

In [42]:
#Selecting vals:

ser[:,'a'] # Get  just 'a's from both levels

10   -0.080820
20   -0.424595
dtype: float64

In [44]:
# We can create a dataframe from the above series:

df = ser.unstack()

df

# Higher index labels= rows, lower = cols

           a         b         c
10 -0.080820 -1.184842  1.377157
20 -0.424595  1.085462  0.187125

In [46]:
df2 = pd.DataFrame(np.arange(24).reshape(4,6),index=[[1,1,2,2],['new','old','new','old']], 
                   columns=[['NY','NY','SF','SF','LA','LA'],['hot','cold','hot','cold','hot','cold',]])

df2

       NY       SF       LA
      hot cold hot cold hot cold
1 new   0    1   2    3   4    5
  old   6    7   8    9  10   11
2 new  12   13  14   15  16   17
  old  18   19  20   21  22   23

In [47]:
# Naming index levels:

# rows:

df2.index.names=['SR_NO','AGE']

# cols:

df2.columns.names=['CITIES','TEMP']

In [48]:
df2

CITIES     NY       SF       LA
TEMP      hot cold hot cold hot cold
SR_NO AGE
1     new   0    1   2    3   4    5
      old   6    7   8    9  10   11
2     new  12   13  14   15  16   17
      old  18   19  20   21  22   23

In [49]:
# swap indexes:

df2.swaplevel('CITIES','TEMP',axis=1) # swapping columns

TEMP      hot cold hot cold hot cold
CITIES     NY   NY  SF   SF  LA   LA
SR_NO AGE
1     new   0    1   2    3   4    5
      old   6    7   8    9  10   11
2     new  12   13  14   15  16   17
      old  18   19  20   21  22   23

In [51]:
df2.swaplevel('SR_NO','AGE')

CITIES     NY       SF       LA
TEMP      hot cold hot cold hot cold
AGE SR_NO
new 1       0    1   2    3   4    5
old 1       6    7   8    9  10   11
new 2      12   13  14   15  16   17
old 2      18   19  20   21  22   23

In [54]:
df2

CITIES     NY       SF       LA
TEMP      hot cold hot cold hot cold
SR_NO AGE
1     new   0    1   2    3   4    5
      old   6    7   8    9  10   11
2     new  12   13  14   15  16   17
      old  18   19  20   21  22   23

In [55]:
# sort
# Outer index, ie. SR_NO is 0 and AGE is 1

df2.sort_index(level=1)

CITIES     NY       SF       LA
TEMP      hot cold hot cold hot cold
SR_NO AGE
1     new   0    1   2    3   4    5
2     new  12   13  14   15  16   17
1     old   6    7   8    9  10   11
2     old  18   19  20   21  22   23

In [56]:
df2.sort_index(level=0)

CITIES     NY       SF       LA
TEMP      hot cold hot cold hot cold
SR_NO AGE
1     new   0    1   2    3   4    5
      old   6    7   8    9  10   11
2     new  12   13  14   15  16   17
      old  18   19  20   21  22   23

In [58]:
# summing at a certain level:

df2.sum(level='TEMP',axis = 1)

TEMP       cold  hot
SR_NO AGE
1     new     9    6
      old    27   24
2     new    45   42
      old    63   60

In [59]:
df2.sum(level='CITIES',axis = 1)

CITIES     LA  NY  SF
SR_NO AGE
1     new   9   1   5
      old  21  13  17
2     new  33  25  29
      old  45  37  41

In [60]:
df2

CITIES     NY       SF       LA
TEMP      hot cold hot cold hot cold
SR_NO AGE
1     new   0    1   2    3   4    5
      old   6    7   8    9  10   11
2     new  12   13  14   15  16   17
      old  18   19  20   21  22   23

In [61]:
df2.sum(level=0)

CITIES  NY       SF       LA
TEMP   hot cold hot cold hot cold
SR_NO
1        6    8  10   12  14   16
2       30   32  34   36  38   40

In [62]:
df2.sum(level=1)

CITIES  NY       SF       LA
TEMP   hot cold hot cold hot cold
AGE
new     12   14  16   18  20   22
old     24   26  28   30  32   34